app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "description", "target_amount", "deadline", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    Project.transaction do
      @project = Project.new(filter_params)
      @project.owner_id = current_user.id
      @project.save!

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "projects" SET "target_amount" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["target_amount", 1000000], ["updated_at", "2015-09-27 18:28:18.409421"], ["id", 4]]
---
  def update
    Project.transaction do
      @project = Project.find(params[:id])
      @project.update_attributes(filter_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 5]]
---
  def destroy
    Project.transaction do
      @project = Project.find(params[:id])
      @project.destroy!